{
  "metadata": {
    "version": "0.38"
  },
  "requests": [
    {
      "method": "TASSERVER",
      "source": "server",
      "description": "This is the first message (i.e. \"greeting message\") that a client receives upon connecting to the server.",
      "params": [
        {
          "name": "protocolVersion",
          "kind": "word",
          "required": true,
          "description": "This is the lobby protocol version used by the server. The client may check if it supports this version before attempting to log in."
        },
        {
          "name": "springVersion",
          "kind": "word",
          "required": true,
          "description": "Default spring version used on lobby server. Can be locally determinated by calling unitsyncs GetSpringVersion(), IsSpringReleaseVersion() and GetSpringVersionPatchset(), which will return the version, for example \"95.0\" or \"94.1.1-1062-g9d16c2d develop\". Note that if the value of this parameter is \"*\", the client should simply ignore it since this means that the server does not contain any updates nor does it require latest Spring version (this is usually the case when the server is running in LAN mode)."
        },
        {
          "name": "udpPort",
          "kind": "word",
          "required": true,
          "description": "This is server UDP port where the \"NAT Help Server\" is running. This is the port to which clients should send their UDP packets when trying to figure out their public UDP source port. This is used with some NAT traversal techniques (e.g. \"hole punching\")."
        },
        {
          "name": "serverMode",
          "kind": "word",
          "required": true,
          "description": "Tells what mode the server is in. Currently valid are:\n- 0: normal model\n- 1: LAN mode"
        }
      ],
      "examples": [
        "TASSERVER 0.35 0.72b1 8201 0",
        "TASSERVER 0.35 * 8201 0"
      ]
    },
    {
      "method": "PING",
      "source": "client",
      "description": "Requests a PONG back from the server. Clients should send PING once every 30 seconds, if no other data is being sent to the server. For details, see the notes above on keep-alive signals.",
      "responses": [
        {
          "method": "PONG",
          "description": ""
        }
      ]
    },
    {
      "method": "STLS",
      "source": "client",
      "description": "Initiate a TLS connection to the server.",
      "responses": [
        {
          "method": "OK",
          "description": "OK"
        }
      ]
    },
    {
      "method": "EXIT",
      "source": "client",
      "description": "Clients should send this as their last command before severing their connection to the server, to notify a clean and deliberate disconnect. The server is not required to acknowledge, or respond, to the exiting client. Other clients via server messages or status change commands.",
      "params": [
        {
          "name": "reason",
          "kind": "sentence",
          "required": false,
          "description": "Clients may optionally specify a reason for quitting. If the user simply wished to exit, many lobby clients send their name and version."
        }
      ]
    },
    {
      "method": "REGISTER",
      "source": "client",
      "description": "The client sends this command when trying to register a new account. Note that the client must not already be logged in, or else the server will deny his request. The username and password are given sanity/uniqueness checks, and these primarily determine the servers response. If email verification is enabled, and no valid email address is provided, the server will deny the registration.",
      "params": [
        {
          "name": "userName",
          "kind": "word",
          "required": true,
          "description": ""
        },
        {
          "name": "password",
          "kind": "word",
          "required": true,
          "description": "The user's password string. If a client uses a secure session (which means the command itself shall be encrypted, including its arguments), it should send BASE64(password), otherwise it should send BASE64(MD5(password))."
        },
        {
          "name": "email",
          "kind": "word",
          "required": false,
          "description": "A valid email address. Case will not be considered."
        }
      ],
      "examples": [
        "REGISTER Johnny Gnmk1g3mcY6OWzJuM4rlMw== enormous_crocodile@hawtmail.com"
      ],
      "responses": [
        {
          "method": "REGISTRATIONACCEPTED",
          "description": ""
        },
        {
          "method": "REGISTRATIONDENIED",
          "description": ""
        }
      ]
    },
    {
      "method": "LOGIN",
      "source": "client",
      "description": "Sent by a client asking to log on to the server. Note: if the client has not yet confirmed the user agreement, then server will send the AGREEMENT to the client as a response to this command. In this case the response to LOGIN will be delayed until after CONFIRMAGREEMENT. Also see LOGININFOEND command.",
      "params": [
        {
          "name": "userName",
          "kind": "word",
          "required": true,
          "description": ""
        },
        {
          "name": "password",
          "kind": "word",
          "required": true,
          "description": "The user's password string. If a client uses a secure session (which means the command itself shall be encrypted, including its arguments), it should send BASE64(password), otherwise it should send BASE64(MD5(password))."
        },
        {
          "name": "cpu",
          "kind": "word",
          "required": true,
          "description": "deprecated, set it to 0"
        },
        {
          "name": "localIP",
          "kind": "word",
          "required": true,
          "description": "The client should supply his local IP (e.g. 192.168.x.y, or whatever it uses) so the server can forward local IPs to clients behind the same NAT (this resolves some of the host/joining issues). If the client is unable to determine its local IP, he should send \"\\*\" instead."
        },
        {
          "name": "lobby name and version",
          "kind": "sentence",
          "required": true,
          "description": ""
        },
        {
          "name": "userID",
          "kind": "word",
          "required": false,
          "description": ""
        },
        {
          "name": "compFlags",
          "kind": "sentence",
          "required": false,
          "description": ""
        }
      ],
      "examples": [
        "LOGIN Johnny Gnmk1g3mcY6OWzJuM4rlMw== 3200 192.168.1.100 SpringLobby 0.264",
        "LOGIN Johnny Gnmk1g3mcY6OWzJuM4rlMw== 3200 * SpringLobby 0.264",
        "LOGIN Johnny Gnmk1g3mcY6OWzJuM4rlMw== 3200 * SpringLobby 0.264\\[TAB\\]123456",
        "LOGIN Johnny Gnmk1g3mcY6OWzJuM4rlMw== 3200 * SpringLobby 0.264\\[TAB\\]0\\[TAB\\]a b"
      ],
      "responses": [
        {
          "method": "ACCEPTED",
          "description": "If the client has previously accepted the user agreement."
        },
        {
          "method": "DENIED",
          "description": "If the client has previously accepted the user agreement."
        },
        {
          "method": "AGREEMENT",
          "description": "If the client has not already acepted the user agreement."
        }
      ]
    },
    {
      "method": "PONG",
      "source": "server",
      "description": "Sent as the response to a PING command.",
      "request": "PING"
    },
    {
      "method": "OK",
      "source": "server",
      "description": "Sent as the response to a STLS command. The client now can now start the tls connection. The server will send again the greeting TASSERVER.",
      "request": "STLS"
    },
    {
      "method": "REGISTRATIONDENIED",
      "source": "server",
      "description": "Sent in response to a REGISTER command, if registration has been refused.",
      "params": [
        {
          "name": "reason",
          "kind": "sentence",
          "required": true,
          "description": ""
        }
      ],
      "request": "REGISTER"
    },
    {
      "method": "REGISTRATIONACCEPTED",
      "source": "server",
      "description": "Sent in response to a REGISTER command, if registration has been accepted. If email verification is enabled, sending of this command notifies that the server has sent a verification code to the users email address. This verification code is expected back from the client in CONFIRMAGREEMENT Upon reciept of this command, a lobby client would normally be expected to reply with a LOGIN attempt (but this is not a requirement of the protocol).",
      "request": "REGISTER"
    },
    {
      "method": "ACCEPTED",
      "source": "server",
      "description": "Sent as a response to the LOGIN command, if it succeeded. Next, the server will send much info about clients and battles:*multiple MOTD, each giving one line of the current welcome message\n* multiple ADDUSER, listing all users currently logged in\n* multiple BATTLEOPENED, UPDATEBATTLEINFO, detailing the state of all currently open battles\n* multiple JOINEDBATTLE, indiciating the clients present in each battle\n* multiple CLIENTSTATUS, detailing the statuses of all currently logged in usersFinally, it will send a LOGININFOEND command indicating that it has finished sending all this info. Note that, except for this final command, the commands/info listed above may be sent to the client in any order.",
      "params": [
        {
          "name": "userName",
          "kind": "word",
          "required": true,
          "description": ""
        }
      ],
      "request": "LOGIN"
    },
    {
      "method": "DENIED",
      "source": "server",
      "description": "Sent as a response to a failed LOGIN command.",
      "params": [
        {
          "name": "reason",
          "kind": "sentence",
          "required": true,
          "description": ""
        }
      ],
      "request": "LOGIN"
    },
    {
      "method": "AGREEMENT",
      "source": "server",
      "description": "Sent by the server upon receiving a LOGIN command, if the client has not yet agreed to the server's \"terms-of-use\". The server may send multiple AGREEMENT commands, each of corresponds to a new line in the agreement text, finishing with an AGREEMENTEND command. The client should send CONFIRMAGREEMENT and then resend the LOGIN command, or disconnect from the server if he has chosen to refuse the agreement.",
      "params": [
        {
          "name": "agreement",
          "kind": "sentence",
          "required": true,
          "description": "The user agreement is sent in \"Text\" format (.txt file streamed via socket)."
        }
      ],
      "request": "LOGIN"
    }
  ]
}
